      * Encrypt/decrypt procedure
     D crypt           PR            10                                         O
     D                                1    VALUE                                I
     D                             2048    VALUE                                I
     D                               16    VALUE                                I
     D                             2048                                         O
     D                                1    VALUE OPTIONS(*NOPASS)               I
